оперативныйучет2/src/AccumulationRegisters/оуп_ДанныеВыпускаПродукции/оуп_ДанныеВыпускаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>оуп_ДанныеВыпускаПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

оперативныйучет2/src/AccumulationRegisters/оуп_ДанныеМатериаловВыпуска/оуп_ДанныеМатериаловВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>оуп_ДанныеМатериаловВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

оперативныйучет2/src/Documents/оуп_СтрокаОтчетаПроизводстваВыпускПодукции/оуп_СтрокаОтчетаПроизводстваВыпускПодукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>оуп_СтрокаОтчетаПроизводстваВыпускПодукции</name>
  <registerRecords>AccumulationRegister.оуп_ДанныеВыпускаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.оуп_ПартииВыпускаПродукции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

оперативныйучет2/src/Documents/оуп_СтрокаОтчетаПроизводстваСписаниеМатериалов/оуп_СтрокаОтчетаПроизводстваСписаниеМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>оуп_СтрокаОтчетаПроизводстваСписаниеМатериалов</name>
  <registerRecords>AccumulationRegister.оуп_ПартииВыпускаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.оуп_ДанныеМатериаловВыпуска</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

оперативныйучет2/src/Catalogs/КонтрольнаяТочка/КонтрольнаяТочка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольнаяТочка</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>МастерТочки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТочки</name>
    <type>
      <types>EnumRef.ТипыКонтрольныхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Весы</name>
    <type>
      <types>CatalogRef.ВесыКонтрольныхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьОстаткиМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВыпуска</name>
    <attributes>
      <name>Страница</name>
      <type>
        <types>CatalogRef.СтраницыФорм</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьКолонкуПланПоСпецификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыПолучатели</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыОтправители</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

оперативныйучет2/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="902506bc-c31b-468b-8f65-73e4c9317c8a">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3112143-6304-49ed-abcf-b14fe2425c34">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

оперативныйучет2/src/CommonModules/оуп_ОтчетВыпускаВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

функция ЗаполнитьТаблицуВыпускаПродукции(
	Параметры, // Структура параметров запроса
	ИмяКолонкиКоличество,
	СтрокаГруппировки,
	ИмяТЧ_ВыходныеИзделия,
	ИмяКолонкиСклада,
	Форма) Экспорт
	ТаблицаВыпуска = ПолучитьДанныеВыпуска(Параметры);
	
	СтрокиТовары = ТаблицаВыпуска.Скопировать();
	СтрокиТовары.Свернуть(СтрокаГруппировки, ИмяКолонкиКоличество);
		
	ТекТЗ = Форма[ИмяТЧ_ВыходныеИзделия].выгрузить();
	ТекТЗ.Очистить();
			
	для Каждого СтрокаТовар из СтрокиТовары Цикл 
		СтрокаВыходИзд = ТекТЗ.Добавить();//Форма[ИмяТЧ_ВыходныеИзделия].Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыходИзд, СтрокаТовар, СтрокаГруппировки);
		ОтборСтроки = новый Структура(СтрокаГруппировки);
		ЗаполнитьЗначенияСвойств(ОтборСтроки, СтрокаТовар);
		СтрокаВыходИзд.количество =  СтрокаТовар.Количество;
		
		
		СтрокиПоСкладам = ТаблицаВыпуска.НайтиСтроки(ОтборСтроки);
		для Каждого СтрокаПоСкладу из СтрокиПоСкладам Цикл 
			если не ЗначениеЗаполнено(СтрокаПоСкладу[ИмяКолонкиСклада]) Тогда 
				// Пустые строки со складами пропускаем...
				Продолжить;
			КонецЕсли;
			
			ТекИмяКолонки = оуп_ФормированиеФорм.ИмяКолонкиСклада(СтрокаПоСкладу[ИмяКолонкиСклада], Форма);
			
			СтрокаВыходИзд[ТекИмяКолонки] = СтрокаПоСкладу[ИмяКолонкиКоличество];
						
		КонецЦикла;
 		
	КонецЦикла;
	Возврат ТекТЗ;
КонецФункции

Процедура ЗаполнитьТаблицуМатериалы(Параметры, Форма, ИмяТЧ="Материалы") Экспорт
	ТаблицаМатериалов = ПолучитьДанныеПоМатериалам(Параметры);
	Форма[ИмяТЧ].Загрузить(ТаблицаМатериалов);
КонецПроцедуры

Процедура ПровестиДокументОтчета(Параметры, ИмяДокумента) Экспорт
	Попытка
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		
		если ИмяДокумента = "Выпуск" Тогда
			ТекДокумент = документы.оуп_СтрокаОтчетаПроизводстваВыпускПодукции.СоздатьДокумент();
		ИначеЕсли ИмяДокумента = "Материалы" Тогда 
			ТекДокумент = документы.оуп_СтрокаОтчетаПроизводстваСписаниеМатериалов.СоздатьДокумент();
		КонецЕсли;
		
		ТекДокумент.Дата = ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(ТекДокумент, Параметры);
		
		ТекДокумент.Записать(РежимЗаписиДокумента.Проведение);
		если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		Иначе 
			ВызватьИсключение "Транзакция не активна!";
		КонецЕсли;
		
	Исключение
		если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Сообщение = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибку(Сообщение);
		ВызватьИсключение Сообщение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеВыпуска(Параметры)
	запрос = новый запрос;
	Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Склад
	|ПОМЕСТИТЬ втСклады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрольнаяТочкаСкладыПолучатели.Склад
	|ИЗ
	|	Справочник.КонтрольнаяТочка.СкладыПолучатели КАК КонтрольнаяТочкаСкладыПолучатели
	|ГДЕ
	|	КонтрольнаяТочкаСкладыПолучатели.Ссылка = &КонтрольнаяТочка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	оуп_ДанныеВыпускаПродукцииОстатки.Спецификация,
	|	оуп_ДанныеВыпускаПродукцииОстатки.Номенклатура,
	|	оуп_ДанныеВыпускаПродукцииОстатки.КоличествоОстаток КАК Количество,
	|	оуп_ДанныеВыпускаПродукцииОстатки.СкладПолучатель КАК Склад
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	РегистрНакопления.оуп_ДанныеВыпускаПродукции.Остатки(, Склад = &Склад
	|	И Спецификация = &Спецификация
	|	И ДатаСмены = &ДатаСмены
	|	И СкладПолучатель В
	|		(ВЫБРАТЬ
	|			вт.склад
	|		ИЗ
	|			втСклады КАК вт)) КАК оуп_ДанныеВыпускаПродукцииОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура
	|ПОМЕСТИТЬ МассивТоваров
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	|ГДЕ
	|	РесурсныеСпецификацииВыходныеИзделия.Ссылка = &Спецификация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втТовары.Номенклатура
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МассивТоваров.Номенклатура,
	|	ЕСТЬNULL(втТовары.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	ЕСТЬNULL(втТовары.Количество, 0) КАК Количество
	|ИЗ
	|	МассивТоваров КАК МассивТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТовары КАК втТовары
	|		ПО МассивТоваров.Номенклатура = втТовары.Номенклатура";
	запрос.УстановитьПараметр("Склад", Параметры.Склад);
	запрос.УстановитьПараметр("Спецификация", Параметры.Спецификация);
	запрос.УстановитьПараметр("ДатаСмены", Параметры.ДатаСмены);
	Запрос.УстановитьПараметр("КонтрольнаяТочка", Параметры.КонтрольнаяТочка);
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	возврат РезультатЗапроса;
КонецФункции

Функция ПолучитьДанныеПоМатериалам(Параметры)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	оуп_ДанныеМатериаловВыпускаОстатки.ДатаСмены,
	|	оуп_ДанныеМатериаловВыпускаОстатки.Спецификация,
	|	оуп_ДанныеМатериаловВыпускаОстатки.Номенклатура,
	|	оуп_ДанныеМатериаловВыпускаОстатки.Склад,
	|	оуп_ДанныеМатериаловВыпускаОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ втМатериалы
	|ИЗ
	|	РегистрНакопления.оуп_ДанныеМатериаловВыпуска.Остатки(, ДатаСмены = &ДатаСмены
	|	И Спецификация = &Спецификация
	|	И Склад = &Склад) КАК оуп_ДанныеМатериаловВыпускаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура
	|ПОМЕСТИТЬ втСпецификация
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	|ГДЕ
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка = &Спецификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСпецификация.Номенклатура
	|ПОМЕСТИТЬ массивТоваров
	|ИЗ
	|	втСпецификация КАК втСпецификация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втМатериалы.Номенклатура
	|ИЗ
	|	втМатериалы КАК втМатериалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	массивТоваров.Номенклатура,
	|	ЕСТЬNULL(втМатериалы.Количество, 0) КАК Количество
	|ИЗ
	|	массивТоваров КАК массивТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втМатериалы КАК втМатериалы
	|		ПО массивТоваров.Номенклатура = втМатериалы.Номенклатура";
	запрос.УстановитьПараметр("Склад", Параметры.Склад);
	запрос.УстановитьПараметр("Спецификация", Параметры.Спецификация);
	запрос.УстановитьПараметр("ДатаСмены", Параметры.ДатаСмены);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Процедура ЗаписатьОшибку(Сообщение)
	ЗаписьЖурналаРегистрации("оуп_ОтчетВыпускаВызовСервера.ПровестиДокументСтрокаВыпуска", 
			УровеньЖурналаРегистрации.Ошибка, документы.оуп_СтрокаОтчетаПроизводстваВыпускПодукции, ,
			Сообщение
			
		);
КонецПроцедуры
#КонецОбласти
